Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum
The load combination types.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.NOT_DEFINED
The load combination type has not been defined.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LG
The LG load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ULS
The ULS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.SLSRC
The SLSRC load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.SLSQP
The SLSQP load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ULSAC
The ULSAC load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.USLEQ
The USLEQ load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.SLS
The SLS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.SLSFC
The SLSFC load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ULSNL
The ULSNL load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ULSEL
The ULSEL load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.SLSD
The SLSD load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACC
The ACC load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.SLSNL
The SLSNL load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ULSUL
The ULSUL load combiantion type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACCUL
The ACCUL load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFPSS
The LFPSS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFPSSWS
The LFPSSWS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFSS
The LFSS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFSSWS
The LFSSWS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFPCS
The LFPCS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFPCSWS
The LFPCSWS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFCS
The LFCS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFCSWS
The LFCSWS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFPS
The LFPS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFPSWS
The LFPSWS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFNPS
The LFNPS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.LFNPSWS
The LFNPSWS load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACITABLE1
The ACITABLE1 load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACITABLE2
The ACITABLE2 load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACITABLE3
The ACITABLE3 load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACITABLE4
The ACITABLE4 load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACITABLE5
The ACITABLE5 load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACITABLE6
The ACITABLE6 load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACITABLE7
The ACITABLE7 load combination type.

Tekla.Structures.Analysis.AnalysisLoadCombination.LoadCombinationEnum.ACITABLE8
The ACITABLE8 load combination type.